<template>
    <div>
        <div class="bonus-page">
            <div class="b-level-list">

                <div class="b-level" :style="{'--box-color': '#F0F0F0'}">
                    <p class="b-title">Black</p>
                    <p class="b-price">
                        <span class="b-price-in" :style="{width: bonus(50000)  + '%'}"></span>
                        <span class="b-price-price" :style="textGradientStyle(50000)">
                            {{bonusSum.toLocaleString('de-DE')}} / 50.000₸
                        </span>
                    </p>
                    <div class="b-info">
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M21.3333 19.3333C21.3333 18.2288 20.4379 17.3333 19.3333 17.3333C18.2288 17.3333 17.3333 18.2288 17.3333 19.3333C17.3333 20.4379 18.2288 21.3333 19.3333 21.3333C20.4379 21.3333 21.3333 20.4379 21.3333 19.3333ZM20.4922 1.63281C21.0159 1.20568 21.7879 1.2358 22.276 1.72396C22.7967 2.24466 22.7967 3.08868 22.276 3.60938L3.60938 22.276C3.08868 22.7967 2.24466 22.7967 1.72396 22.276C1.20326 21.7553 1.20326 20.9113 1.72396 20.3906L20.3906 1.72396L20.4922 1.63281ZM6.66667 4.66667C6.66667 3.5621 5.77124 2.66667 4.66667 2.66667C3.5621 2.66667 2.66667 3.5621 2.66667 4.66667C2.66667 5.77124 3.5621 6.66667 4.66667 6.66667C5.77124 6.66667 6.66667 5.77124 6.66667 4.66667ZM24 19.3333C24 21.9107 21.9107 24 19.3333 24C16.756 24 14.6667 21.9107 14.6667 19.3333C14.6667 16.756 16.756 14.6667 19.3333 14.6667C21.9107 14.6667 24 16.756 24 19.3333ZM9.33333 4.66667C9.33333 7.244 7.244 9.33333 4.66667 9.33333C2.08934 9.33333 0 7.244 0 4.66667C0 2.08934 2.08934 0 4.66667 0C7.244 0 9.33333 2.08934 9.33333 4.66667Z" fill="url(#paint0_linear_268_1275)"/>
                            <defs>
                                <linearGradient id="paint0_linear_268_1275" x1="24" y1="12" x2="0" y2="12" gradientUnits="userSpaceOnUse">
                                    <stop stop-color="white"/>
                                    <stop offset="1" stop-color="#F0F0F0"/>
                                </linearGradient>
                            </defs>
                        </svg>
                        <div class="b-info-text">
                            <p class="b-info-title">
                                5% кэшбэк
                            </p>
                            <p class="b-info-dec">
                                с каждой аренды
                            </p>
                        </div>
                    </div>
                    <a href="https://wa.me/77778176891?text=Здравствуйте,%20интересует%20бонусный%20уровень%20Black" class="b-btn" v-if="level < 1">
                        Подключить
                    </a>
                    <a href="" class="b-btn-active" v-else >
                        <svg width="24" height="18" viewBox="0 0 24 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M21.724 0.405549C22.2447 -0.135183 23.0888 -0.135183 23.6095 0.405549C24.1302 0.946281 24.1302 1.82277 23.6095 2.3635L8.94255 17.5945C8.42184 18.1352 7.57781 18.1352 7.0571 17.5945L0.390319 10.6713L0.299172 10.5658C-0.127969 10.022 -0.0978439 9.22027 0.390319 8.71334C0.878482 8.2064 1.6505 8.17512 2.1742 8.61869L2.27577 8.71334L7.99982 14.6575L21.724 0.405549Z" fill="#404040"/>
                        </svg>
                        <span>Подключено</span>
                    </a>
                </div>

                <div class="b-level" :style="{'--box-color': '#C48750'}">
                    <p class="b-title">Bronze</p>
                    <p class="b-price">
                        <span class="b-price-in" :style="{width: bonus(500000)  + '%'}"></span>
                        <span class="b-price-price" :style="textGradientStyle(500000)">
                            {{bonusSum.toLocaleString('de-DE')}} / 500.000₸
                        </span>
                    </p>
                    <div class="b-info">
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M21.3333 19.3333C21.3333 18.2288 20.4379 17.3333 19.3333 17.3333C18.2288 17.3333 17.3333 18.2288 17.3333 19.3333C17.3333 20.4379 18.2288 21.3333 19.3333 21.3333C20.4379 21.3333 21.3333 20.4379 21.3333 19.3333ZM20.4922 1.63281C21.0159 1.20568 21.7879 1.2358 22.276 1.72396C22.7967 2.24466 22.7967 3.08868 22.276 3.60938L3.60938 22.276C3.08868 22.7967 2.24466 22.7967 1.72396 22.276C1.20326 21.7553 1.20326 20.9113 1.72396 20.3906L20.3906 1.72396L20.4922 1.63281ZM6.66667 4.66667C6.66667 3.5621 5.77124 2.66667 4.66667 2.66667C3.5621 2.66667 2.66667 3.5621 2.66667 4.66667C2.66667 5.77124 3.5621 6.66667 4.66667 6.66667C5.77124 6.66667 6.66667 5.77124 6.66667 4.66667ZM24 19.3333C24 21.9107 21.9107 24 19.3333 24C16.756 24 14.6667 21.9107 14.6667 19.3333C14.6667 16.756 16.756 14.6667 19.3333 14.6667C21.9107 14.6667 24 16.756 24 19.3333ZM9.33333 4.66667C9.33333 7.244 7.244 9.33333 4.66667 9.33333C2.08934 9.33333 0 7.244 0 4.66667C0 2.08934 2.08934 0 4.66667 0C7.244 0 9.33333 2.08934 9.33333 4.66667Z" fill="url(#paint0_linear_268_1286)"/>
                            <defs>
                                <linearGradient id="paint0_linear_268_1286" x1="24" y1="12" x2="0" y2="12" gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#D59A61"/>
                                    <stop offset="1" stop-color="#C48750"/>
                                </linearGradient>
                            </defs>
                        </svg>

                        <div class="b-info-text">
                            <p class="b-info-title">
                                10% кэшбэк
                            </p>
                            <p class="b-info-dec">
                                с каждой аренды
                            </p>
                        </div>
                    </div>
<!--                    <div class="b-info">-->
<!--                        <svg width="29" height="24" viewBox="0 0 29 24" fill="none" xmlns="http://www.w3.org/2000/svg">-->
<!--                            <path d="M26.3636 13.8021L26.3624 13.8008L21.7757 8.0013L21.7745 8H18.4545V17.0234C19.1545 16.3888 20.0769 16 21.0909 16C22.8123 16 24.2731 17.1138 24.8163 18.6667H26.3636V13.8021ZM7.90909 18.6667C7.18108 18.6667 6.59091 19.2636 6.59091 20C6.59091 20.7364 7.18108 21.3333 7.90909 21.3333C8.6371 21.3333 9.22727 20.7364 9.22727 20C9.22727 19.2636 8.6371 18.6667 7.90909 18.6667ZM21.0909 18.6667C20.3629 18.6667 19.7727 19.2636 19.7727 20C19.7727 20.7364 20.3629 21.3333 21.0909 21.3333C21.8189 21.3333 22.4091 20.7364 22.4091 20C22.4091 19.2636 21.8189 18.6667 21.0909 18.6667ZM15.8182 4C15.8182 3.64638 15.6792 3.30734 15.432 3.05729C15.2156 2.83843 14.9319 2.70343 14.63 2.67318L14.5 2.66667H3.95455C3.60494 2.66667 3.26976 2.80724 3.02255 3.05729C2.77534 3.30734 2.63636 3.64638 2.63636 4V18.6667H4.18368C4.72692 17.1138 6.18774 16 7.90909 16C9.63044 16 11.0913 17.1138 11.6345 18.6667H15.8182V4ZM18.4545 5.33333H21.7783L22.0731 5.35026C22.366 5.38404 22.652 5.4676 22.9189 5.59766C23.2741 5.77089 23.5865 6.02311 23.8328 6.33464H23.8341L28.4194 12.1341L28.552 12.3164C28.8419 12.7532 28.9991 13.2688 29 13.7982V18.6667C29 19.3739 28.722 20.052 28.2276 20.5521C27.7332 21.0522 27.0628 21.3333 26.3636 21.3333H24.8163C24.2731 22.8862 22.8123 24 21.0909 24C19.3696 24 17.9087 22.8862 17.3655 21.3333H11.6345C11.0913 22.8862 9.63044 24 7.90909 24C6.18774 24 4.72692 22.8862 4.18368 21.3333H2.63636C1.93716 21.3333 1.26679 21.0522 0.772372 20.5521C0.339631 20.1144 0.072692 19.5404 0.0128729 18.9297L0 18.6667V4C0 2.93913 0.416937 1.92202 1.15856 1.17188C1.90018 0.421729 2.90574 0 3.95455 0H14.5L14.8913 0.0195312C15.7964 0.110543 16.6472 0.515611 17.296 1.17188C18.0376 1.92202 18.4545 2.93913 18.4545 4V5.33333Z" fill="url(#paint0_linear_268_1287)"/>-->
<!--                            <defs>-->
<!--                                <linearGradient id="paint0_linear_268_1287" x1="29" y1="12" x2="0" y2="12" gradientUnits="userSpaceOnUse">-->
<!--                                    <stop stop-color="#D59A61"/>-->
<!--                                    <stop offset="1" stop-color="#C48750"/>-->
<!--                                </linearGradient>-->
<!--                            </defs>-->
<!--                        </svg>-->


<!--                        <div class="b-info-text">-->
<!--                            <p class="b-info-title">-->
<!--                                При аренде от 25.000 ₸-->
<!--                            </p>-->
<!--                            <p class="b-info-dec">-->
<!--                                Бесплатная доставка на одну сторону-->
<!--                            </p>-->
<!--                        </div>-->
<!--                    </div>-->
                    <a href="https://wa.me/77778176891?text=Здравствуйте,%20интересует%20бонусный%20уровень%20Bronze" class="b-btn" v-if="level < 2">
                        Подключить
                    </a>
                    <a href="" class="b-btn-active" v-else >
                        <svg width="24" height="18" viewBox="0 0 24 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M21.724 0.405549C22.2447 -0.135183 23.0888 -0.135183 23.6095 0.405549C24.1302 0.946281 24.1302 1.82277 23.6095 2.3635L8.94255 17.5945C8.42184 18.1352 7.57781 18.1352 7.0571 17.5945L0.390319 10.6713L0.299172 10.5658C-0.127969 10.022 -0.0978439 9.22027 0.390319 8.71334C0.878482 8.2064 1.6505 8.17512 2.1742 8.61869L2.27577 8.71334L7.99982 14.6575L21.724 0.405549Z" fill="#404040"/>
                        </svg>
                        <span>Подключено</span>
                    </a>
                </div>

                <div class="b-level" :style="{'--box-color': '#3DAF84'}">
                    <p class="b-title">Emerald</p>
                    <p class="b-price">
                        <span class="b-price-in" :style="{width: bonus(1500000)  + '%'}"></span>
                        <span class="b-price-price" :style="textGradientStyle(1500000)">
                            {{bonusSum.toLocaleString('de-DE')}} / 1.500.000₸
                        </span>
                    </p>
                    <div class="b-info">
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M21.3333 19.3333C21.3333 18.2288 20.4379 17.3333 19.3333 17.3333C18.2288 17.3333 17.3333 18.2288 17.3333 19.3333C17.3333 20.4379 18.2288 21.3333 19.3333 21.3333C20.4379 21.3333 21.3333 20.4379 21.3333 19.3333ZM20.4922 1.63281C21.0159 1.20568 21.7879 1.2358 22.276 1.72396C22.7967 2.24466 22.7967 3.08868 22.276 3.60938L3.60938 22.276C3.08868 22.7967 2.24466 22.7967 1.72396 22.276C1.20326 21.7553 1.20326 20.9113 1.72396 20.3906L20.3906 1.72396L20.4922 1.63281ZM6.66667 4.66667C6.66667 3.5621 5.77124 2.66667 4.66667 2.66667C3.5621 2.66667 2.66667 3.5621 2.66667 4.66667C2.66667 5.77124 3.5621 6.66667 4.66667 6.66667C5.77124 6.66667 6.66667 5.77124 6.66667 4.66667ZM24 19.3333C24 21.9107 21.9107 24 19.3333 24C16.756 24 14.6667 21.9107 14.6667 19.3333C14.6667 16.756 16.756 14.6667 19.3333 14.6667C21.9107 14.6667 24 16.756 24 19.3333ZM9.33333 4.66667C9.33333 7.244 7.244 9.33333 4.66667 9.33333C2.08934 9.33333 0 7.244 0 4.66667C0 2.08934 2.08934 0 4.66667 0C7.244 0 9.33333 2.08934 9.33333 4.66667Z" fill="url(#paint0_linear_268_1299)"/>
                            <defs>
                                <linearGradient id="paint0_linear_268_1299" x1="24" y1="12" x2="0" y2="12" gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#5DD4A2"/>
                                    <stop offset="1" stop-color="#3DAF84"/>
                                </linearGradient>
                            </defs>
                        </svg>


                        <div class="b-info-text">
                            <p class="b-info-title">
                                15% кэшбэк
                            </p>
                            <p class="b-info-dec">
                                с каждой аренды
                            </p>
                        </div>
                    </div>
                    <div class="b-info">
                        <svg width="29" height="24" viewBox="0 0 29 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M26.3636 13.8021L26.3624 13.8008L21.7757 8.0013L21.7745 8H18.4545V17.0234C19.1545 16.3888 20.0769 16 21.0909 16C22.8123 16 24.2731 17.1138 24.8163 18.6667H26.3636V13.8021ZM7.90909 18.6667C7.18108 18.6667 6.59091 19.2636 6.59091 20C6.59091 20.7364 7.18108 21.3333 7.90909 21.3333C8.6371 21.3333 9.22727 20.7364 9.22727 20C9.22727 19.2636 8.6371 18.6667 7.90909 18.6667ZM21.0909 18.6667C20.3629 18.6667 19.7727 19.2636 19.7727 20C19.7727 20.7364 20.3629 21.3333 21.0909 21.3333C21.8189 21.3333 22.4091 20.7364 22.4091 20C22.4091 19.2636 21.8189 18.6667 21.0909 18.6667ZM15.8182 4C15.8182 3.64638 15.6792 3.30734 15.432 3.05729C15.2156 2.83843 14.9319 2.70343 14.63 2.67318L14.5 2.66667H3.95455C3.60494 2.66667 3.26976 2.80724 3.02255 3.05729C2.77534 3.30734 2.63636 3.64638 2.63636 4V18.6667H4.18368C4.72692 17.1138 6.18774 16 7.90909 16C9.63044 16 11.0913 17.1138 11.6345 18.6667H15.8182V4ZM18.4545 5.33333H21.7783L22.0731 5.35026C22.366 5.38404 22.652 5.4676 22.9189 5.59766C23.2741 5.77089 23.5865 6.02311 23.8328 6.33464H23.8341L28.4194 12.1341L28.552 12.3164C28.8419 12.7532 28.9991 13.2688 29 13.7982V18.6667C29 19.3739 28.722 20.052 28.2276 20.5521C27.7332 21.0522 27.0628 21.3333 26.3636 21.3333H24.8163C24.2731 22.8862 22.8123 24 21.0909 24C19.3696 24 17.9087 22.8862 17.3655 21.3333H11.6345C11.0913 22.8862 9.63044 24 7.90909 24C6.18774 24 4.72692 22.8862 4.18368 21.3333H2.63636C1.93716 21.3333 1.26679 21.0522 0.772372 20.5521C0.339631 20.1144 0.072692 19.5404 0.0128729 18.9297L0 18.6667V4C0 2.93913 0.416937 1.92202 1.15856 1.17188C1.90018 0.421729 2.90574 0 3.95455 0H14.5L14.8913 0.0195312C15.7964 0.110543 16.6472 0.515611 17.296 1.17188C18.0376 1.92202 18.4545 2.93913 18.4545 4V5.33333Z" fill="url(#paint0_linear_268_1300)"/>
                            <defs>
                                <linearGradient id="paint0_linear_268_1300" x1="29" y1="12" x2="0" y2="12" gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#5DD4A2"/>
                                    <stop offset="1" stop-color="#3DAF84"/>
                                </linearGradient>
                            </defs>
                        </svg>
                        <div class="b-info-text">
                            <p class="b-info-title">
                                При аренде от 25.000 ₸
                            </p>
                            <p class="b-info-dec">
                                Бесплатная доставка на одну сторону
                            </p>
                        </div>
                    </div>
                    <div class="b-info">
                        <svg width="22" height="24" viewBox="0 0 22 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M5.49463 12.9833C5.46967 12.7335 5.35829 12.4987 5.17773 12.3196C4.97144 12.115 4.69174 12 4.4 12H2.2V16.3636C2.2 16.653 2.31598 16.9304 2.52227 17.1349C2.72856 17.3395 3.00826 17.4545 3.3 17.4545H4.4C4.69174 17.4545 4.97144 17.3395 5.17773 17.1349C5.35829 16.9559 5.46967 16.7211 5.49463 16.4712L5.5 16.3636V13.0909L5.49463 12.9833ZM7.7 16.3636L7.68389 16.6875C7.6088 17.4366 7.27462 18.1406 6.7332 18.6776C6.11433 19.2913 5.27522 19.6364 4.4 19.6364H3.3C2.42479 19.6364 1.58567 19.2913 0.966797 18.6776C0.347927 18.0638 0 17.2316 0 16.3636V10.9091L0.0128906 10.3722C0.0749574 9.12298 0.353179 7.89197 0.836816 6.73402C1.38962 5.41051 2.20017 4.20793 3.22158 3.19496C4.243 2.18198 5.4556 1.37813 6.79014 0.829901C8.12472 0.281667 9.55546 0 11 0C12.4445 0 13.8753 0.281667 15.2099 0.829901C16.5444 1.37813 17.757 2.18198 18.7784 3.19496C19.7998 4.20793 20.6104 5.41051 21.1632 6.73402C21.716 8.05757 22 9.47649 22 10.9091V18.5455C22 19.9921 21.4201 21.3791 20.3887 22.402C19.3572 23.4249 17.9587 24 16.5 24H11C10.3925 24 9.9 23.5116 9.9 22.9091C9.9 22.3066 10.3925 21.8182 11 21.8182H16.5C17.3752 21.8182 18.2143 21.4731 18.8332 20.8594C19.2206 20.4752 19.501 20.0053 19.6571 19.4947C19.3494 19.5872 19.0274 19.6364 18.7 19.6364H17.6C16.7248 19.6364 15.8857 19.2913 15.2668 18.6776C14.7254 18.1406 14.3912 17.4366 14.3161 16.6875L14.3 16.3636V13.0909C14.3 12.2229 14.6479 11.3907 15.2668 10.777C15.8857 10.1632 16.7248 9.81818 17.6 9.81818H19.728C19.63 9.04707 19.4309 8.29032 19.1297 7.56925C18.6874 6.51049 18.0401 5.54792 17.2229 4.73757C16.4058 3.92722 15.4353 3.28518 14.3677 2.84659C13.3 2.408 12.1556 2.18182 11 2.18182C9.84437 2.18182 8.69999 2.408 7.63232 2.84659C6.56474 3.28518 5.59415 3.92722 4.77705 4.73757C3.95995 5.54792 3.31255 6.51049 2.87031 7.56925C2.56915 8.29032 2.36997 9.04707 2.27197 9.81818H4.4C5.27522 9.81818 6.11433 10.1632 6.7332 10.777C7.35207 11.3907 7.7 12.2229 7.7 13.0909V16.3636ZM16.5 16.3636L16.5054 16.4712C16.5303 16.7211 16.6417 16.9559 16.8223 17.1349C17.0286 17.3395 17.3083 17.4545 17.6 17.4545H18.7C18.9917 17.4545 19.2714 17.3395 19.4777 17.1349C19.684 16.9304 19.8 16.653 19.8 16.3636V12H17.6C17.3083 12 17.0286 12.115 16.8223 12.3196C16.616 12.5242 16.5 12.8016 16.5 13.0909V16.3636Z" fill="url(#paint0_linear_268_1301)"/>
                            <defs>
                                <linearGradient id="paint0_linear_268_1301" x1="22" y1="12" x2="0" y2="12" gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#5DD4A2"/>
                                    <stop offset="1" stop-color="#3DAF84"/>
                                </linearGradient>
                            </defs>
                        </svg>
                        <div class="b-info-text">
                            <p class="b-info-title">
                                VIP поддержка
                            </p>
                            <p class="b-info-dec">
                                Горячая линия по срочным вопросам/решениям
                            </p>
                        </div>
                    </div>
                    <a href="https://wa.me/77778176891?text=Здравствуйте,%20интересует%20бонусный%20уровень%20Emerald" class="b-btn" v-if="level < 3">
                        Подключить
                    </a>
                    <a href="" class="b-btn-active" v-else >
                        <svg width="24" height="18" viewBox="0 0 24 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M21.724 0.405549C22.2447 -0.135183 23.0888 -0.135183 23.6095 0.405549C24.1302 0.946281 24.1302 1.82277 23.6095 2.3635L8.94255 17.5945C8.42184 18.1352 7.57781 18.1352 7.0571 17.5945L0.390319 10.6713L0.299172 10.5658C-0.127969 10.022 -0.0978439 9.22027 0.390319 8.71334C0.878482 8.2064 1.6505 8.17512 2.1742 8.61869L2.27577 8.71334L7.99982 14.6575L21.724 0.405549Z" fill="#404040"/>
                        </svg>
                        <span>Подключено</span>
                    </a>
                </div>

                <div class="b-level" :style="{'--box-color': '#9965C4'}">
                    <p class="b-title">Amethyst</p>
                    <p class="b-price">
                        <span class="b-price-in" :style="{width: bonus(5000000)  + '%'}"></span>
                        <span class="b-price-price" :style="textGradientStyle(5000000)">
                            {{bonusSum.toLocaleString('de-DE')}} / 5.000.000₸
                        </span>
                    </p>
                    <div class="b-info">
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M21.3333 19.3333C21.3333 18.2288 20.4379 17.3333 19.3333 17.3333C18.2288 17.3333 17.3333 18.2288 17.3333 19.3333C17.3333 20.4379 18.2288 21.3333 19.3333 21.3333C20.4379 21.3333 21.3333 20.4379 21.3333 19.3333ZM20.4922 1.63281C21.0159 1.20568 21.7879 1.2358 22.276 1.72396C22.7967 2.24466 22.7967 3.08868 22.276 3.60938L3.60938 22.276C3.08868 22.7967 2.24466 22.7967 1.72396 22.276C1.20326 21.7553 1.20326 20.9113 1.72396 20.3906L20.3906 1.72396L20.4922 1.63281ZM6.66667 4.66667C6.66667 3.5621 5.77124 2.66667 4.66667 2.66667C3.5621 2.66667 2.66667 3.5621 2.66667 4.66667C2.66667 5.77124 3.5621 6.66667 4.66667 6.66667C5.77124 6.66667 6.66667 5.77124 6.66667 4.66667ZM24 19.3333C24 21.9107 21.9107 24 19.3333 24C16.756 24 14.6667 21.9107 14.6667 19.3333C14.6667 16.756 16.756 14.6667 19.3333 14.6667C21.9107 14.6667 24 16.756 24 19.3333ZM9.33333 4.66667C9.33333 7.244 7.244 9.33333 4.66667 9.33333C2.08934 9.33333 0 7.244 0 4.66667C0 2.08934 2.08934 0 4.66667 0C7.244 0 9.33333 2.08934 9.33333 4.66667Z" fill="url(#paint0_linear_268_1314)"/>
                            <defs>
                                <linearGradient id="paint0_linear_268_1314" x1="24" y1="12" x2="0" y2="12" gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#B58FE3"/>
                                    <stop offset="1" stop-color="#9965C4"/>
                                </linearGradient>
                            </defs>
                        </svg>
                        <div class="b-info-text">
                            <p class="b-info-title">
                                30% кэшбэк
                            </p>
                            <p class="b-info-dec">
                                с каждой аренды
                            </p>
                        </div>
                    </div>
                    <div class="b-info">
                        <svg width="29" height="24" viewBox="0 0 29 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M26.3636 13.8021L26.3624 13.8008L21.7757 8.0013L21.7745 8H18.4545V17.0234C19.1545 16.3888 20.0769 16 21.0909 16C22.8123 16 24.2731 17.1138 24.8163 18.6667H26.3636V13.8021ZM7.90909 18.6667C7.18108 18.6667 6.59091 19.2636 6.59091 20C6.59091 20.7364 7.18108 21.3333 7.90909 21.3333C8.6371 21.3333 9.22727 20.7364 9.22727 20C9.22727 19.2636 8.6371 18.6667 7.90909 18.6667ZM21.0909 18.6667C20.3629 18.6667 19.7727 19.2636 19.7727 20C19.7727 20.7364 20.3629 21.3333 21.0909 21.3333C21.8189 21.3333 22.4091 20.7364 22.4091 20C22.4091 19.2636 21.8189 18.6667 21.0909 18.6667ZM15.8182 4C15.8182 3.64638 15.6792 3.30734 15.432 3.05729C15.2156 2.83843 14.9319 2.70343 14.63 2.67318L14.5 2.66667H3.95455C3.60494 2.66667 3.26976 2.80724 3.02255 3.05729C2.77534 3.30734 2.63636 3.64638 2.63636 4V18.6667H4.18368C4.72692 17.1138 6.18774 16 7.90909 16C9.63044 16 11.0913 17.1138 11.6345 18.6667H15.8182V4ZM18.4545 5.33333H21.7783L22.0731 5.35026C22.366 5.38404 22.652 5.4676 22.9189 5.59766C23.2741 5.77089 23.5865 6.02311 23.8328 6.33464H23.8341L28.4194 12.1341L28.552 12.3164C28.8419 12.7532 28.9991 13.2688 29 13.7982V18.6667C29 19.3739 28.722 20.052 28.2276 20.5521C27.7332 21.0522 27.0628 21.3333 26.3636 21.3333H24.8163C24.2731 22.8862 22.8123 24 21.0909 24C19.3696 24 17.9087 22.8862 17.3655 21.3333H11.6345C11.0913 22.8862 9.63044 24 7.90909 24C6.18774 24 4.72692 22.8862 4.18368 21.3333H2.63636C1.93716 21.3333 1.26679 21.0522 0.772372 20.5521C0.339631 20.1144 0.072692 19.5404 0.0128729 18.9297L0 18.6667V4C0 2.93913 0.416937 1.92202 1.15856 1.17188C1.90018 0.421729 2.90574 0 3.95455 0H14.5L14.8913 0.0195312C15.7964 0.110543 16.6472 0.515611 17.296 1.17188C18.0376 1.92202 18.4545 2.93913 18.4545 4V5.33333Z" fill="url(#paint0_linear_268_1315)"/>
                            <defs>
                                <linearGradient id="paint0_linear_268_1315" x1="29" y1="12" x2="0" y2="12" gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#B58FE3"/>
                                    <stop offset="1" stop-color="#9965C4"/>
                                </linearGradient>
                            </defs>
                        </svg>
                        <div class="b-info-text">
                            <p class="b-info-title">
                                При аренде от 25.000 ₸
                            </p>
                            <p class="b-info-dec">
                                Бесплатная доставка на одну сторону
                            </p>
                        </div>
                    </div>
                    <div class="b-info">
                        <svg width="22" height="24" viewBox="0 0 22 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M5.49463 12.9833C5.46967 12.7335 5.35829 12.4987 5.17773 12.3196C4.97144 12.115 4.69174 12 4.4 12H2.2V16.3636C2.2 16.653 2.31598 16.9304 2.52227 17.1349C2.72856 17.3395 3.00826 17.4545 3.3 17.4545H4.4C4.69174 17.4545 4.97144 17.3395 5.17773 17.1349C5.35829 16.9559 5.46967 16.7211 5.49463 16.4712L5.5 16.3636V13.0909L5.49463 12.9833ZM7.7 16.3636L7.68389 16.6875C7.6088 17.4366 7.27462 18.1406 6.7332 18.6776C6.11433 19.2913 5.27522 19.6364 4.4 19.6364H3.3C2.42479 19.6364 1.58567 19.2913 0.966797 18.6776C0.347927 18.0638 0 17.2316 0 16.3636V10.9091L0.0128906 10.3722C0.0749574 9.12298 0.353179 7.89197 0.836816 6.73402C1.38962 5.41051 2.20017 4.20793 3.22158 3.19496C4.243 2.18198 5.4556 1.37813 6.79014 0.829901C8.12472 0.281667 9.55546 0 11 0C12.4445 0 13.8753 0.281667 15.2099 0.829901C16.5444 1.37813 17.757 2.18198 18.7784 3.19496C19.7998 4.20793 20.6104 5.41051 21.1632 6.73402C21.716 8.05757 22 9.47649 22 10.9091V18.5455C22 19.9921 21.4201 21.3791 20.3887 22.402C19.3572 23.4249 17.9587 24 16.5 24H11C10.3925 24 9.9 23.5116 9.9 22.9091C9.9 22.3066 10.3925 21.8182 11 21.8182H16.5C17.3752 21.8182 18.2143 21.4731 18.8332 20.8594C19.2206 20.4752 19.501 20.0053 19.6571 19.4947C19.3494 19.5872 19.0274 19.6364 18.7 19.6364H17.6C16.7248 19.6364 15.8857 19.2913 15.2668 18.6776C14.7254 18.1406 14.3912 17.4366 14.3161 16.6875L14.3 16.3636V13.0909C14.3 12.2229 14.6479 11.3907 15.2668 10.777C15.8857 10.1632 16.7248 9.81818 17.6 9.81818H19.728C19.63 9.04707 19.4309 8.29032 19.1297 7.56925C18.6874 6.51049 18.0401 5.54792 17.2229 4.73757C16.4058 3.92722 15.4353 3.28518 14.3677 2.84659C13.3 2.408 12.1556 2.18182 11 2.18182C9.84437 2.18182 8.69999 2.408 7.63232 2.84659C6.56474 3.28518 5.59415 3.92722 4.77705 4.73757C3.95995 5.54792 3.31255 6.51049 2.87031 7.56925C2.56915 8.29032 2.36997 9.04707 2.27197 9.81818H4.4C5.27522 9.81818 6.11433 10.1632 6.7332 10.777C7.35207 11.3907 7.7 12.2229 7.7 13.0909V16.3636ZM16.5 16.3636L16.5054 16.4712C16.5303 16.7211 16.6417 16.9559 16.8223 17.1349C17.0286 17.3395 17.3083 17.4545 17.6 17.4545H18.7C18.9917 17.4545 19.2714 17.3395 19.4777 17.1349C19.684 16.9304 19.8 16.653 19.8 16.3636V12H17.6C17.3083 12 17.0286 12.115 16.8223 12.3196C16.616 12.5242 16.5 12.8016 16.5 13.0909V16.3636Z" fill="url(#paint0_linear_268_1308)"/>
                            <defs>
                                <linearGradient id="paint0_linear_268_1308" x1="22" y1="12" x2="0" y2="12" gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#B58FE3"/>
                                    <stop offset="1" stop-color="#9965C4"/>
                                </linearGradient>
                            </defs>
                        </svg>
                        <div class="b-info-text">
                            <p class="b-info-title">
                                VIP поддержка
                            </p>
                            <p class="b-info-dec">
                                Горячая линия по срочным вопросам/решениям
                            </p>
                        </div>
                    </div>
                    <a href="https://wa.me/77778176891?text=Здравствуйте,%20интересует%20бонусный%20уровень%20Amethyst" class="b-btn" v-if="level < 4">
                        Подключить
                    </a>
                    <a href="" class="b-btn-active" v-else >
                        <svg width="24" height="18" viewBox="0 0 24 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M21.724 0.405549C22.2447 -0.135183 23.0888 -0.135183 23.6095 0.405549C24.1302 0.946281 24.1302 1.82277 23.6095 2.3635L8.94255 17.5945C8.42184 18.1352 7.57781 18.1352 7.0571 17.5945L0.390319 10.6713L0.299172 10.5658C-0.127969 10.022 -0.0978439 9.22027 0.390319 8.71334C0.878482 8.2064 1.6505 8.17512 2.1742 8.61869L2.27577 8.71334L7.99982 14.6575L21.724 0.405549Z" fill="#404040"/>
                        </svg>
                        <span>Подключено</span>
                    </a>
                </div>

            </div>
            <div class="bonus-page-left">
                <p class="big-white-title">
                    Вопросы и ответы
                </p>
                <div class="faq-list">
                    <FaqItem
                        v-for="(item, index) in faqs"
                        :key="index"
                        :question="item.question"
                        :answer="item.answer"
                    />
                </div>
            </div>
<!--            <div class="bonus-page-right">-->
<!--                <div class="bonus-level-block" style="background: linear-gradient(to bottom, #191E22, #0A0C0E);">-->
<!--                    <p class="title">-->
<!--                        <img v-if="level < 1"-->
<!--                            src="/img/locked.svg" alt="icon" class="lock-icon">-->
<!--                      <span>Black</span>-->
<!--                    </p>-->
<!--                    <p class="bonus">-->
<!--                        {{bonusSum}} / 50 000 ₸-->
<!--                    </p>-->
<!--                    <div class="text-block">-->
<!--                        <p class="title">-->
<!--                            5% кэшбек-->
<!--                        </p>-->
<!--                        <p class="text">-->
<!--                            с каждой аренды-->
<!--                        </p>-->
<!--                    </div>-->
<!--                    <div class="text-block">-->
<!--                        <p class="title">-->
<!--                            При аренде от 25 000 ₸-->
<!--                        </p>-->
<!--                        <p class="text">-->
<!--                            Бесплатная доставка на одну сторону-->
<!--                        </p>-->
<!--                    </div>-->
<!--                    <a href="https://wa.me/77011234567?text=Здравствуйте,%20интересует%20бонусный%20уровень%20Black"-->
<!--                       target="_blank" class="btn-bonus">Подключить</a>-->
<!--                </div>-->
<!--                <br>-->
<!--                <div class="bonus-level-block" style="background: linear-gradient(to bottom, #3C2B1F, #18100D);">-->
<!--                    <p class="title">-->
<!--                        <img v-if="level < 2"-->
<!--                             src="/img/locked.svg" alt="icon" class="lock-icon">-->
<!--                        <span>Bronze</span>-->
<!--                    </p>-->
<!--                    <p class="bonus">-->
<!--                        {{bonusSum}} / 500 000 ₸-->
<!--                    </p>-->
<!--                    <div class="text-block">-->
<!--                        <p class="title">-->
<!--                            10% кэшбек-->
<!--                        </p>-->
<!--                        <p class="text">-->
<!--                            с каждой аренды-->
<!--                        </p>-->
<!--                    </div>-->
<!--                    <div class="text-block">-->
<!--                        <p class="title">-->
<!--                            При аренде от 25 000 ₸-->
<!--                        </p>-->
<!--                        <p class="text">-->
<!--                            Бесплатная доставка на одну сторону-->
<!--                        </p>-->
<!--                    </div>-->
<!--                    <a href="https://wa.me/77011234567?text=Здравствуйте,%20интересует%20бонусный%20уровень%20Bronze"-->
<!--                       target="_blank" class="btn-bonus">Подключить</a>-->
<!--                </div>-->
<!--                <br>-->
<!--                <div class="bonus-level-block" style="background: linear-gradient(to bottom, #1A231C, #0A0E0B);">-->
<!--                    <p class="title">-->
<!--                        <img v-if="level < 3"-->
<!--                             src="/img/locked.svg" alt="icon" class="lock-icon">-->
<!--                        <span>Emerald</span>-->
<!--                    </p>-->
<!--                    <p class="bonus">-->
<!--                        {{bonusSum}} / 1 500 000 ₸-->
<!--                    </p>-->
<!--                    <div class="text-block">-->
<!--                        <p class="title">-->
<!--                            15% кэшбек-->
<!--                        </p>-->
<!--                        <p class="text">-->
<!--                            с каждой аренды-->
<!--                        </p>-->
<!--                    </div>-->
<!--                    <div class="text-block">-->
<!--                        <p class="title">-->
<!--                            При аренде от 25 000 ₸-->
<!--                        </p>-->
<!--                        <p class="text">-->
<!--                            Бесплатная доставка на одну сторону-->
<!--                        </p>-->
<!--                    </div>-->
<!--                    <a href="https://wa.me/77011234567?text=Здравствуйте,%20интересует%20бонусный%20уровень%20Emerald"-->
<!--                       target="_blank" class="btn-bonus">Подключить</a>-->
<!--                </div>-->
<!--                <br>-->
<!--                <div class="bonus-level-block" style="background: linear-gradient(to bottom, #260724, #0F030E);">-->
<!--                    <p class="title">-->
<!--                        <img v-if="level < 4"-->
<!--                             src="/img/locked.svg" alt="icon" class="lock-icon">-->
<!--                        <span>Amethyst</span>-->
<!--                    </p>-->
<!--                    <p class="bonus">-->
<!--                        {{bonusSum}} / 5 000 000 ₸-->
<!--                    </p>-->
<!--                    <div class="text-block">-->
<!--                        <p class="title">-->
<!--                            30% кэшбек-->
<!--                        </p>-->
<!--                        <p class="text">-->
<!--                            с каждой аренды-->
<!--                        </p>-->
<!--                    </div>-->
<!--                    <div class="text-block">-->
<!--                        <p class="title">-->
<!--                            При аренде от 25 000 ₸-->
<!--                        </p>-->
<!--                        <p class="text">-->
<!--                            Бесплатная доставка на одну сторону-->
<!--                        </p>-->
<!--                    </div>-->
<!--                    <a href="https://wa.me/77011234567?text=Здравствуйте,%20интересует%20бонусный%20уровень%20Amethyst"-->
<!--                       target="_blank" class="btn-bonus">Подключить</a>-->
<!--                </div>-->
<!--            </div>-->
        </div>
    </div>
</template>

<script>
import FaqItem from '../components/bonus/FaqItem.vue'
import axios from "axios";
import auth from "../auth.js";
export default {
    components: {FaqItem},
    data() {
       return {
           faqs: [
               {
                   question: 'Как получить кэшбек',
                   answer: 'Программа лояльности Pixel: чем больше покупок — тем выше кэшбек!</br>' +
                       '</br>' +
                       'На сайте действует система уровней, позволяющая нашим клиентам увеличивать процент кэшбека в зависимости от суммы совершённых покупок.</br>' +
                       '</br>' +
                       'Стартовый уровень “Black”: При накоплении покупок на сумму от 50 000 ₸ вы получаете уровень “Black” и начинаете получать кэшбек в размере 5% от стоимости заказов.</br>' +
                       '</br>' +
                       'Следующий уровень “Bronze”: Как только ваши траты достигнут 500 000 ₸, вы автоматически переходите на уровень “Bronze”, и ваш кэшбек увеличивается до 10%.</br>' +
                       '</br>' +
                       'Предпоследний уровень “Emerald”: При общей сумме покупок свыше 1 500000 ₸ вы становитесь участником уровня “Emerald” с максимальным кэшбеком — 15%.</br>' +
                       '</br>' +
                       'Наивысший уровень “Amethyst”: При общей сумме покупок свыше 5 000 000 ₸ вы становитесь участником уровня “Amethyst” с максимальным кэшбеком — 15%.</br>' +
                       '</br>' +
                       'Хотите сразу получить повышенный кэшбек? Вы можете купить желаемый уровень через наш отдел продаж и откройте доступ к уровням “Bronze”, “Emerald”, “Amethyst” без ожидания!</br>' +
                       '</br>' +
                       'Обратите внимание: В расчёт суммы для перехода на следующий уровень включаются только средства, оплаченные банковской картой или наличными в офисе. Платежи бонусами не учитываются. Например, если вы оплачиваете заказ на 10 000 ₸, из которых 3 000 ₸ списаны бонусами, то в зачет идёт только 7 000 ₸.'
               },
               {
                   question: 'Как вывести Pixel coin',
                   answer: 'Вы легко можете вывести ваши бонусы на реальные деньги ! </br>' +
                       '</br>' +
                       'Вам просто нужно зайти в ваш профиль и отправить запрос на вывод бонусов! </br>' +
                       '</br>' +
                       'Запрос обрабатывается в течении нескольких рабочих дней. </br>' +
                       '</br>' +
                       'В случае одобрения, средства поступят вам на указанные вами реквизиты ! </br>' +
                       '</br>' +
                       'Важно! Конвертация Pixel coin - Тенге 2 к 1, то есть 10.000 бонусов = 5.000 тенге.'
               },
               {
                   question: 'Как заработать Pixel coin (бонусы)',
                   answer: 'На данный момент вы можете накапливать бонусы двумя способами: </br>' +
                       '•⁠  ⁠При оформлении заказов на нашем сайте </br>' +
                       '•⁠  ⁠⁠Реферальная система'
               },
               {
                   question: 'Как работает реферальная система ?',
                   answer: 'Наша реферальная система — это простой способ получать бонусы за то, что вы рекомендуете наш рентал своим друзьям!</br>' +
                       '</br>' +
                       'Вот как это работает:</br>' +
                       '</br>' +
                       'Поделитесь реферальной ссылкой, которая находится в вашем профиле с друзьями.</br>' +
                       'Отправьте ссылку или код друзьям через мессенджеры, соцсети или просто покажите при встрече.</br>' +
                       '</br>' +
                       'Когда ваш друг регистрируется с вашим кодом и совершает покупки, вы получаете 5% бонусов от суммы каждого заказа на свой счёт.</br>' +
                       'Больше друзей — больше бонусов!</br>' +
                       'Приглашайте сколько угодно друзей — бонусы начисляются за каждого нового покупателя.</br>'
               },
           ],
           clientData: null,
           isAuthenticated: false,
           level: 0,
           bonusSum: 0
       }
    },
    mounted() {
      this.getClientData()
    },
    methods: {
        async getClientData() {
            const responseAuth = axios.get('sanctum/csrf-cookie').then(response => {
                console.log(response)
            })

            const csrfToken = document.querySelector('meta[name="csrf-token"]').getAttribute('content');
            console.log(csrfToken)
            axios.defaults.headers.common['X-CSRF-TOKEN'] = csrfToken;
            const response = await axios.request({
                method: 'GET',
                url: '/api/client',
                //   headers: { 'X-CSRF-TOKEN': csrfToken },
                withCredentials: true
            })
            console.log(response.data);
            this.clientData = response.data.clientData
            if (response.data.clientData && response.data.clientData.bonus) {
                this.level = response.data.clientData.bonus.level
                this.bonusSum = this.formatMoney(response.data.clientData.bonus.total_earned)
            }
            this.isAuthenticated = response.data.isAuthenticated
        },
        formatMoney(num) {
            return num.toString().replace(/\B(?=(\d{3})+(?!\d))/g, " ");
        },
        bonus(sum) {
            let percent = (this.bonusSum / sum) * 100
            percent = Math.min(percent, 100)
            percent = percent < 5 ? 0 : percent
            return parseInt(percent)
        },
        textGradientStyle(sum) {
            const bonusValue = this.bonus(sum) + '%'; // пример
            console.log(bonusValue)
            return {
                background: 'linear-gradient(to right, #404040 0px, #404040 ' + bonusValue + ',  var(--box-color) ' + bonusValue + ',  var(--box-color) 100%)',
                WebkitBackgroundClip: 'text',
                WebkitTextFillColor: 'transparent'
            };
        }
    }
}
</script>

<style lang="scss" scoped>
</style>
